### 데이터프레임 병합

In [2]:
import pandas as pd
import numpy as np

In [6]:
df = pd.DataFrame(np.arange(16).reshape((4, 4)),
                  index=['Ohio', 'Colorado', 'Utah', 'New York'],
                  columns=['one',' two', 'three', 'four'])
df

          one   two  three  four
Ohio        0     1      2     3
Colorado    4     5      6     7
Utah        8     9     10    11
New York   12    13     14    15

In [7]:
# df.loc['Colorado'][1]

5

pd.concat

행방향, 열방향 모두 데이터 병합 가능
 - 디폴트 열방향 합침 -> 컬럼명 참조
 - axis=1 인수 사용시 컬럼으로 병합 -> 인덱스 참조

In [ ]:
# case1 : 데이터의 컬럼명 같고 인덱스 다름

In [10]:
add_table1 = pd.DataFrame(np.random.choice(100, 16).reshape((4,4)),
                         index=['Hawaii', 'Washington', 'Seattle', 'Texas'],
                         columns=['one', 'two', 'three', 'four'])

In [11]:
add_table1

            one  two  three  four
Hawaii       57   63     55    43
Washington   57   82      4     1
Seattle      57   68      3    15
Texas        16   52     95    70

In [15]:
# concat  aptjem (칼럼명 같을 때 )     --> 컬럼명 같음을 확인하고 실행
pd.concat([df,add_table1])

            one   two  three  four   two
Ohio          0   1.0      2     3   NaN
Colorado      4   5.0      6     7   NaN
Utah          8   9.0     10    11   NaN
New York     12  13.0     14    15   NaN
Hawaii       57   NaN     55    43  63.0
Washington   57   NaN      4     1  82.0
Seattle      57   NaN      3    15  68.0
Texas        16   NaN     95    70  52.0

In [16]:
# concat 메서드 (칼럼명 같을 때) - axix 인수 사용  --> 행 이름 참조하고 concat 메서드 진행
pd.concat([df,add_table1], axis=1)

             one   two  three  four   one   two  three  four
Ohio         0.0   1.0    2.0   3.0   NaN   NaN    NaN   NaN
Colorado     4.0   5.0    6.0   7.0   NaN   NaN    NaN   NaN
Utah         8.0   9.0   10.0  11.0   NaN   NaN    NaN   NaN
New York    12.0  13.0   14.0  15.0   NaN   NaN    NaN   NaN
Hawaii       NaN   NaN    NaN   NaN  57.0  63.0   55.0  43.0
Washington   NaN   NaN    NaN   NaN  57.0  82.0    4.0   1.0
Seattle      NaN   NaN    NaN   NaN  57.0  68.0    3.0  15.0
Texas        NaN   NaN    NaN   NaN  16.0  52.0   95.0  70.0

In [ ]:
# case2 : 데이터의 컬럼명 같고 인덱스 같음

In [17]:
add_table2 = pd.DataFrame(np.random.choice(100, 16).reshape((4,4)),
                         index=['Ohio', 'Colorado', 'Utah', 'New York'],
                         columns=['one',' two', 'three', 'four'])

In [19]:
# 디폴트 행 바인드
pd.concat([df,add_table2])

          one   two  three  four
Ohio        0     1      2     3
Colorado    4     5      6     7
Utah        8     9     10    11
New York   12    13     14    15
Ohio       22    71     81    81
Colorado    4    43     93    41
Utah       60    73     28    89
New York   50    20     67    78

In [20]:
# 컬럼 바인드
pd.concat([df, add_table2], axis=1)

          one   two  three  four  one   two  three  four
Ohio        0     1      2     3   22    71     81    81
Colorado    4     5      6     7    4    43     93    41
Utah        8     9     10    11   60    73     28    89
New York   12    13     14    15   50    20     67    78

In [ ]:
# case3 : 데이터의 인덱스, 컬럼명 다름

In [21]:
# concat 메서드 (컬럼명 다를 때)

add_table3 = pd.DataFrame(np.random.choice(100, 16).reshape((4,4)),
                         index=['Hawaii', 'Washington', 'Seattle', 'Texas'],
                         columns=['five', 'six', 'seven', 'eight'])

In [22]:
pd.concat([df, add_table3])

# concat을 이용한 행 바인드시 컬럼명이 다르므로 밑으로 바로 병합해주지 못함.

             one   two  three  four  five   six  seven  eight
Ohio         0.0   1.0    2.0   3.0   NaN   NaN    NaN    NaN
Colorado     4.0   5.0    6.0   7.0   NaN   NaN    NaN    NaN
Utah         8.0   9.0   10.0  11.0   NaN   NaN    NaN    NaN
New York    12.0  13.0   14.0  15.0   NaN   NaN    NaN    NaN
Hawaii       NaN   NaN    NaN   NaN  12.0  16.0   76.0   63.0
Washington   NaN   NaN    NaN   NaN  49.0  32.0   70.0   84.0
Seattle      NaN   NaN    NaN   NaN  66.0  76.0   55.0   36.0
Texas        NaN   NaN    NaN   NaN  97.0  47.0   59.0   84.0

In [23]:
# 컬럼 바인드
pd.concat([df, add_table3], axis=1)

# 마찬가지로 컬럼 바인드 시에도 인덱스가 달라서 옆으로 병합 불가

             one   two  three  four  five   six  seven  eight
Ohio         0.0   1.0    2.0   3.0   NaN   NaN    NaN    NaN
Colorado     4.0   5.0    6.0   7.0   NaN   NaN    NaN    NaN
Utah         8.0   9.0   10.0  11.0   NaN   NaN    NaN    NaN
New York    12.0  13.0   14.0  15.0   NaN   NaN    NaN    NaN
Hawaii       NaN   NaN    NaN   NaN  12.0  16.0   76.0   63.0
Washington   NaN   NaN    NaN   NaN  49.0  32.0   70.0   84.0
Seattle      NaN   NaN    NaN   NaN  66.0  76.0   55.0   36.0
Texas        NaN   NaN    NaN   NaN  97.0  47.0   59.0   84.0

In [ ]:
# quiz) 아래와 같이 행이름 없는 데이터를 기존의 df와 컬럼 바인드 수행해보세요.

In [36]:
add_table4 = pd.DataFrame(np.random.choice(100, 16).reshape((4, 4)),
                         columns=['five', 'six', 'seven', 'eight'])

In [37]:
add_table4

   five  six  seven  eight
0    78    0     31     29
1    49   12     75     97
2    57   91     94     57
3    83   27     70     70

In [40]:
add_table4.index = df.index

In [41]:
pd.concat([df, add_table4], axis=1)

          one   two  three  four  five  six  seven  eight
Ohio        0     1      2     3    78    0     31     29
Colorado    4     5      6     7    49   12     75     97
Utah        8     9     10    11    57   91     94     57
New York   12    13     14    15    83   27     70     70

apply & applymap 메서드

In [45]:
add_table11 = pd.DataFrame(np.random.randn(4,3),
                            index=['Hawaii', 'Washington', 'Seattle', 'Texas'],
                            columns=['one','two','three'])

In [46]:
add_table11

                 one       two     three
Hawaii      0.145971  0.198102  0.734965
Washington -0.568463  0.761369  0.981991
Seattle    -0.689594 -0.576739 -0.588982
Texas      -0.693106 -2.629806  0.127357

In [47]:
# 절대값
np.abs(add_table11)

                 one       two     three
Hawaii      0.145971  0.198102  0.734965
Washington  0.568463  0.761369  0.981991
Seattle     0.689594  0.576739  0.588982
Texas       0.693106  2.629806  0.127357

위 add_table11에서 컬럼별 or 행별로 '최대값 - 최소값'을 구하고 싶다면?

--> apply()와 람다표현식을 적용하여 간단히 해결

In [48]:
f = lambda x: x.max() - x.min()

In [49]:
# 디폴트 행축으로 연산
add_table11.apply(f)

one      0.839078
two      3.391175
three    1.570974
dtype: float64

In [50]:
# 컬럼 간 연산
add_table11.apply(f, axis=1) # 행에 대한 결과를 뽑아내는 것

Hawaii        0.588994
Washington    1.550454
Seattle       0.112855
Texas         2.757163
dtype: float64

In [ ]:
## 추가+

In [53]:
?pd.DataFrame.to_dict

In [54]:
add_table11

                 one       two     three
Hawaii      0.145971  0.198102  0.734965
Washington -0.568463  0.761369  0.981991
Seattle    -0.689594 -0.576739 -0.588982
Texas      -0.693106 -2.629806  0.127357

In [55]:
a = add_table11.to_dict('series')

In [56]:
a['one']

Hawaii        0.145971
Washington   -0.568463
Seattle      -0.689594
Texas        -0.693106
Name: one, dtype: float64

### applymap method

In [57]:
lambda a, b, c: a + b + c

In [59]:
(lambda a, b, c: a + b + c)(1,2,3)

6

In [61]:
f2 = lambda x: '%.2f' % x

In [62]:
f2(10.872)

'10.87'

In [63]:
add_table12 = add_table11.applymap(f2)

In [64]:
add_table12['one']

Hawaii         0.15
Washington    -0.57
Seattle       -0.69
Texas         -0.69
Name: one, dtype: object

In [65]:
add_table12 # 문자열

              one    two  three
Hawaii       0.15   0.20   0.73
Washington  -0.57   0.76   0.98
Seattle     -0.69  -0.58  -0.59
Texas       -0.69  -2.63   0.13

In [68]:
# add_table12['one'][0] + 1 # error

In [66]:
np.round(add_table11, 2) # 수치형

             one   two  three
Hawaii      0.15  0.20   0.73
Washington -0.57  0.76   0.98
Seattle    -0.69 -0.58  -0.59
Texas      -0.69 -2.63   0.13

#### quiz) 아래와 같은 데이터프레임을 생성하고 합계 컬럼과 평균 컬럼을 구해보세요(람다 표현식 사용)

In [98]:
score_df = pd.DataFrame(np.arange(9).reshape((3, 3)),
                        columns=['이름', 'math', 'eng'])
score_df[['이름']] = ['A', 'B', 'C']
score_df[['math']] = [72, 84, 91]
score_df[['eng']] = [80, 82, 79]

In [99]:
score_df

  이름  math  eng
0  A    72   80
1  B    84   82
2  C    91   79

In [101]:
score_df.insert(3, 'sum', (lambda a, b: a + b)(score_df['math'], score_df['eng']))

In [102]:
score_df

  이름  math  eng  sum
0  A    72   80  152
1  B    84   82  166
2  C    91   79  170

In [104]:
score_df.insert(4, 'average', (lambda a, b: (a+b)/2)(score_df['math'], score_df['eng']))

In [105]:
score_df

  이름  math  eng  sum  average
0  A    72   80  152     76.0
1  B    84   82  166     83.0
2  C    91   79  170     85.0

In [ ]:
# 답 예시,

In [ ]:
score_df['합계'] \
score_df[['math', 'eng']].apply(lambda x: x.sum(), axis=1)

In [ ]:
score_df['평균'] \
score_df[['math', 'eng']].apply(lambda x: x.mean(), axis=1)

In [ ]:
score_df

### Reading and writing data in text format

In [112]:
import pandas as pd

In [113]:
df = pd.read_csv("data/ex1.csv")

In [115]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [119]:
pd.read_csv("data/ex2.csv")

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [120]:
pd.read_csv("data/ex2.csv", header=None)  # header가 없다.

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [124]:
pd.read_csv("data/ex2.csv", names=['a', 'b', 'c', 'd', 'message']) # 내가 원하는 컬럼명으로  data 불러오기

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [126]:
names=['a', 'b', 'c', 'd', 'message']

In [127]:
pd.read_csv("data/ex2.csv", names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [129]:
result = pd.read_csv('data/ex3.txt')
result

               A         B         C
0  aaa -0.264438 -1.026059 -0.619500
1  bbb  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  ddd -0.871858 -0.348382  1.100491

In [2]:
import pandas as pd

In [4]:
result = pd.read_csv('data/ex3.txt', sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [133]:
pd.read_csv('data/ex4.csv', skiprows=[0,2,3])  # 0, 2, 3 행 skip

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### excel 파일 불러오기

In [138]:
pd.read_excel('data/ex1.xlsx', header=0, sheet_name=0)

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo